app/controllers/favorites_controller.rb

  def destroy
    @favorite = Favorite.find(params[:id])
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."id" = ? LIMIT 1  [["id", 1]]