app/controllers/pages_controller.rb

  def explore
    @tweets = Tweet.where("user_id in (?) OR user_id = ?", current_user.friend_ids, current_user).paginate(page: params[:page]).order('created_at DESC')
    @tweets = Tweet.all.last(10)
    @tofollow = User.all.last(5)
---
SELECT  "tweets".* FROM "tweets"   ORDER BY "tweets"."id" DESC LIMIT 10
SELECT  "users".* FROM "users"   ORDER BY "users"."id" DESC LIMIT 5

  def search_results
    @tweets = Tweet.where("user_id in (?) OR user_id = ?", current_user.friend_ids, current_user).paginate(page: params[:page]).order('created_at DESC')
    @tweets = Tweet.search(params[:search])
    @tofollow = User.all.last(5)
---
SELECT COUNT(*) FROM "tweets"  WHERE (tweet_text LIKE '%hiii\%')
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"   ORDER BY "users"."id" DESC LIMIT 5