app/controllers/tweets_controller.rb

  def destroy
    @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 9]]

  def reply
    @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 8]]