app/controllers/users_controller.rb

SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."user_id" = ?  ORDER BY created_at DESC LIMIT 20 OFFSET 0  [["user_id", 1]]
---
  def show
    @tweets = @user.tweets.paginate(page: params[:page]).order('created_at DESC')

UPDATE "users" SET "about" = ?, "avatar" = ?, "cover" = ?, "location" = ?, "updated_at" = ?, "website" = ? WHERE "users"."id" = 1  [["about", ""], ["avatar", "anon.jpeg"], ["cover", "banner1.png"], ["location", ""], ["updated_at", "2016-10-20 20:17:32.045935"], ["website", ""]]
---
  def update
    @user.update(user_params)

SELECT  "tweets".* FROM "tweets" INNER JOIN "favorites" ON "favorites"."tweet_id" = "tweets"."id" WHERE "tweets"."user_id" = ? LIMIT 20 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets" INNER JOIN "favorites" ON "favorites"."tweet_id" = "tweets"."id" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---
  def favorites
    @favorites = @user.tweets.joins(:favorites).paginate(page: params[:page])

SELECT  "retweets".* FROM "retweets"  WHERE "retweets"."retweeter_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["retweeter_id", 1]]
---
  def retweets
    @retweets = @user.retweeter_id.paginate(page: params[:page]).order('created_at DESC')

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def set_user
    @user = User.friendly.find(params[:id])